# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Binaries
brew 'bash'
brew 'zsh'
brew 'zsh-completions'
brew 'git'
brew 'tree'
brew 'node'
brew 'trash'
brew 'wget'
brew 'vim'
brew 'neovim'
brew 'awk'
brew 'ack'
brew 'tmux'
brew 'the_silver_searcher'
brew 'fzf'
brew 'lazydocker'
brew 'python'
brew 'ripgrep'

# Development
brew 'php'
brew 'imagemagick'

# Editors
cask 'sublime-text'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-cascadia'
cask 'font-fira-code'
