# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'bash'
brew 'zsh'
brew 'zsh-completions'
brew 'git'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'
brew 'vim'
brew 'neovim'
brew 'awk'
brew 'tmux'
brew 'the_silver_searcher'
brew 'fzf'
brew 'lazydocker'

# Development
brew 'php'
brew 'php@7.3'
brew 'php@7.4'
brew 'imagemagick'

# Apps
cask 'alfred'
cask 'java'
cask 'slack'
cask 'vlc'
cask 'sourcetree'
cask 'spotify'
cask 'moom'
cask 'avocode'
cask 'notion'
cask 'caffeine'
cask 'plex'
cask 'cleanmymac'
cask 'dropbox'
cask 'itsycal'

# Dev apps
cask 'insomnia'
cask 'tableplus'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'cyberduck'
cask 'figma'
cask 'docker'
cask 'iterm2'

# Browsers
cask 'firefox'
cask 'google-chrome'
cask 'microsoft-edge'

# Editors
cask 'sublime-text'
cask 'visual-studio-code'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-cascadia'
cask 'font-fira-code'

# Install Mac App Store apps
mas 'Gapplin', id: 768053424
mas 'Keynote', id: 409183694
mas '1Password 7', id: 1333542190
mas 'Spark', id: 1176895641
mas 'Microsoft Word', id: 462054704
mas 'Microsoft Excel', id: 462058435