# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'

# Development
brew 'php71'
brew 'php71-intl'
brew 'php71-imagick'

# Apps
cask 'alfred'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'gpgtools'
cask 'iterm2'
cask 'java'
cask 'phpstorm'
cask 'sequel-pro'
cask 'shuttle'
cask 'slack'
cask 'sublime-text'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'sourcetree'
cask 'paw'
cask 'spotify'
cask 'cyberduck'
cask 'moom'
cask 'avocode'
cask 'robo-3t'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas 'Gapplin', id: 768053424
mas 'Unsplash Wallpapers', id: 1284863847
mas 'Keynote', id: 409183694
mas 'Wunderlist', id: 410628904
